IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN3_CFG_MCAN3_CFG.xml
	<register id="MCAN3_CFG_TEST" acronym="MCAN3_CFG_TEST" offset="0x210" width="32" description="">
		<bitfield id="RX" width="1" begin="7" end="7" resetval="0x0" description="Receive Pin" range="7" rwaccess="RO"/> 
		<bitfield id="TX" width="2" begin="6" end="5" resetval="0x0" description="Control of Transmit Pin" range="6 - 5" rwaccess="RW"/> 
		<bitfield id="LBCK" width="1" begin="4" end="4" resetval="0x0" description="Loop Back Mode" range="4" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_RWD" acronym="MCAN3_CFG_RWD" offset="0x214" width="32" description="">
		<bitfield id="WDV" width="8" begin="15" end="8" resetval="0x0" description="Watchdog Value" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="WDC" width="8" begin="7" end="0" resetval="0x0" description="Watchdog Counter Value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_CCCR" acronym="MCAN3_CFG_CCCR" offset="0x218" width="32" description="">
		<bitfield id="TXP" width="1" begin="14" end="14" resetval="0x0" description="Transmit Pause" range="14" rwaccess="RW"/> 
		<bitfield id="EFBI" width="1" begin="13" end="13" resetval="0x0" description="Edge Filtering durign Bus Integration" range="13" rwaccess="RW"/> 
		<bitfield id="PXHD" width="1" begin="12" end="12" resetval="0x0" description="Protocol Exception Handling Disable" range="12" rwaccess="RW"/> 
		<bitfield id="BRSE" width="1" begin="9" end="9" resetval="0x0" description="Bit Rate Switch Enable" range="9" rwaccess="RW"/> 
		<bitfield id="FDOE" width="1" begin="8" end="8" resetval="0x0" description="FD Operation Enable" range="8" rwaccess="RW"/> 
		<bitfield id="TEST" width="1" begin="7" end="7" resetval="0x0" description="Test Mode enable" range="7" rwaccess="RW"/> 
		<bitfield id="DAR" width="1" begin="6" end="6" resetval="0x0" description="Disable Automatic Regransmission" range="6" rwaccess="RW"/> 
		<bitfield id="MON" width="1" begin="5" end="5" resetval="0x0" description="Bus Monitoring Mode" range="5" rwaccess="RW"/> 
		<bitfield id="CSR" width="1" begin="4" end="4" resetval="0x0" description="Clock Stop Request" range="4" rwaccess="RW"/> 
		<bitfield id="CSA" width="1" begin="3" end="3" resetval="0x0" description="Clock Stop Acknowledge" range="3" rwaccess="RO"/> 
		<bitfield id="ASM" width="1" begin="2" end="2" resetval="0x0" description="Restriced Operation Mode" range="2" rwaccess="RW"/> 
		<bitfield id="CCE" width="1" begin="1" end="1" resetval="0x0" description="Configuration Change Enable" range="1" rwaccess="RW"/> 
		<bitfield id="INIT" width="1" begin="0" end="0" resetval="0x1" description="Initialization" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_NBTP" acronym="MCAN3_CFG_NBTP" offset="0x21C" width="32" description="">
		<bitfield id="NSJW" width="7" begin="31" end="25" resetval="0x3" description="Nominal Resynchronization Jump Width" range="31 - 25" rwaccess="RW"/> 
		<bitfield id="NBRP" width="9" begin="24" end="16" resetval="0x0" description="Nominal Baud Rate Prescaler" range="24 - 16" rwaccess="RW"/> 
		<bitfield id="NTSEG1" width="8" begin="15" end="8" resetval="0x10" description="Nominal Time segment before sample point" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="NTSEG2" width="7" begin="6" end="0" resetval="0x3" description="Nominal Time segment after sample point" range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_TSCC" acronym="MCAN3_CFG_TSCC" offset="0x220" width="32" description="">
		<bitfield id="TCP" width="4" begin="19" end="16" resetval="0x0" description="Timestamp Counter Prescaler" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="TSS" width="2" begin="1" end="0" resetval="0x0" description="Timestamp Select" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_TSCV" acronym="MCAN3_CFG_TSCV" offset="0x224" width="32" description="">
		<bitfield id="TSC" width="16" begin="15" end="0" resetval="0x0" description="Timestamp Counter" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_TOCC" acronym="MCAN3_CFG_TOCC" offset="0x228" width="32" description="">
		<bitfield id="TOP" width="16" begin="31" end="16" resetval="0x65535" description="Timeout Period" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="TOS" width="2" begin="2" end="1" resetval="0x0" description="Timeout Select" range="2 - 1" rwaccess="RW"/> 
		<bitfield id="ETOC" width="1" begin="0" end="0" resetval="0x0" description="Enable Timeout Counter" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_TOCV" acronym="MCAN3_CFG_TOCV" offset="0x22C" width="32" description="">
		<bitfield id="TOC" width="16" begin="15" end="0" resetval="0x65535" description="Timeout Counter" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_RES00" acronym="MCAN3_CFG_RES00" offset="0x230" width="32" description="">
		
	</register>
	<register id="MCAN3_CFG_RES01" acronym="MCAN3_CFG_RES01" offset="0x234" width="32" description="">
		
	</register>
	<register id="MCAN3_CFG_RES02" acronym="MCAN3_CFG_RES02" offset="0x238" width="32" description="">
		
	</register>
	<register id="MCAN3_CFG_RES03" acronym="MCAN3_CFG_RES03" offset="0x23C" width="32" description="">
		
	</register>
	<register id="MCAN3_CFG_ECR" acronym="MCAN3_CFG_ECR" offset="0x240" width="32" description="">
		<bitfield id="CEL" width="8" begin="23" end="16" resetval="0x0" description="CAN Error Logging" range="23 - 16" rwaccess="RO"/> 
		<bitfield id="RP" width="1" begin="15" end="15" resetval="0x0" description="Recieve Error Passive" range="15" rwaccess="RO"/> 
		<bitfield id="REC" width="7" begin="14" end="8" resetval="0x0" description="Recieve Error Counter" range="14 - 8" rwaccess="RO"/> 
		<bitfield id="TEC" width="8" begin="7" end="0" resetval="0x0" description="Transmit Error Counter" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN3_CFG_PSR" acronym="MCAN3_CFG_PSR" offset="0x244" width="32" description="">
		<bitfield id="TDCV" width="7" begin="22" end="16" resetval="0x0" description="Transmitter Delay Compensation Value" range="22 - 16" rwaccess="RO"/> 
		<bitfield id="PXE" width="1" begin="14" end="14" resetval="0x0" description="Protocol Exception Event" range="14" rwaccess="RO"/> 
		<bitfield id="RFDF" width="1" begin="13" end="13" resetval="0x0" description="Recieved a CAN FD Message" range="13" rwaccess="RO"/> 
		<bitfield id="RBRS" width="1" begin="12" end="12" resetval="0x0" description="BRS flag of last recieved CAN FD Message" range="12" rwaccess="RO"/> 
		<bitfield id="RESI" width="1" begin="11" end="11" resetval="0x0" description="ESI flag of last recieved CAN FD Message" range="11" rwaccess="RO"/> 
		<bitfield id="DLEC" width="3" begin="10" end="8" resetval="0x7" description="Data Phase Last Error Code" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="BO" width="1" begin="7" end="7" resetval="0x0" description="Bus_Off status" range="7" rwaccess="RO"/> 
		<bitfield id="EW" width="1" begin="6" end="6" resetval="0x0" description="Warning Status" range="6" rwaccess="RO"/> 
		<bitfield id="EP" width="1" begin="5" end="5" resetval="0x0" description="Error Passive" range="5" rwaccess="RO"/> 
		<bitfield id="ACT" width="2" begin="4" end="3" resetval="0x0" description="Activity" range="4 - 3" rwaccess="RO"/> 
		<bitfield id="LEC" width="3" begin="2" end="0" resetval="0x7" description="Last Error Code" range="2 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN3_CFG_TDCR" acronym="MCAN3_CFG_TDCR" offset="0x248" width="32" description="">
		<bitfield id="TDCO" width="7" begin="14" end="8" resetval="0x0" description="Transmitter Delay Compensation Offset" range="14 - 8" rwaccess="RW"/> 
		<bitfield id="TDCF" width="7" begin="6" end="0" resetval="0x0" description="Transmitter Delay Compensation Filter Window Length" range="6 - 0" rwaccess="RW"/>
	</register>
