IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN3_CFG_MCAN3_CFG.xml
	<register id="MCAN3_CFG_RES04" acronym="MCAN3_CFG_RES04" offset="0x24C" width="32" description="">
		
	</register>
	<register id="MCAN3_CFG_IR" acronym="MCAN3_CFG_IR" offset="0x250" width="32" description="">
		<bitfield id="ARA" width="1" begin="29" end="29" resetval="0x0" description="Access to Reserved Address" range="29" rwaccess="RW"/> 
		<bitfield id="PED" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in data Phase" range="28" rwaccess="RW"/> 
		<bitfield id="PEA" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase" range="27" rwaccess="RW"/> 
		<bitfield id="WDI" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt" range="26" rwaccess="RW"/> 
		<bitfield id="BO" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status" range="25" rwaccess="RW"/> 
		<bitfield id="EW" width="1" begin="24" end="24" resetval="0x0" description="Warning Status" range="24" rwaccess="RW"/> 
		<bitfield id="EP" width="1" begin="23" end="23" resetval="0x0" description="Error Passive" range="23" rwaccess="RW"/> 
		<bitfield id="ELO" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow" range="22" rwaccess="RW"/> 
		<bitfield id="BEU" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected" range="21" rwaccess="RW"/> 
		<bitfield id="BEC" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected" range="20" rwaccess="RW"/> 
		<bitfield id="DRX" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer" range="19" rwaccess="RW"/> 
		<bitfield id="TOO" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred" range="18" rwaccess="RW"/> 
		<bitfield id="MRAF" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure" range="17" rwaccess="RW"/> 
		<bitfield id="TSW" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound" range="16" rwaccess="RW"/> 
		<bitfield id="TEFL" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Element Lost" range="15" rwaccess="RW"/> 
		<bitfield id="TEFF" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full" range="14" rwaccess="RW"/> 
		<bitfield id="TEFW" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached" range="13" rwaccess="RW"/> 
		<bitfield id="TEFN" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry" range="12" rwaccess="RW"/> 
		<bitfield id="TFE" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty" range="11" rwaccess="RW"/> 
		<bitfield id="TCF" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finished" range="10" rwaccess="RW"/> 
		<bitfield id="TC" width="1" begin="9" end="9" resetval="0x0" description="Transmission Complete" range="9" rwaccess="RW"/> 
		<bitfield id="HPM" width="1" begin="8" end="8" resetval="0x0" description="High Priority Message" range="8" rwaccess="RW"/> 
		<bitfield id="RF1L" width="1" begin="7" end="7" resetval="0x0" description="Rx FIFO 1 Message Lost" range="7" rwaccess="RW"/> 
		<bitfield id="RF1F" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full" range="6" rwaccess="RW"/> 
		<bitfield id="RF1W" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached" range="5" rwaccess="RW"/> 
		<bitfield id="RF1N" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message" range="4" rwaccess="RW"/> 
		<bitfield id="RF0L" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost" range="3" rwaccess="RW"/> 
		<bitfield id="RF0F" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full" range="2" rwaccess="RW"/> 
		<bitfield id="RF0W" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached" range="1" rwaccess="RW"/> 
		<bitfield id="RF0N" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_IE" acronym="MCAN3_CFG_IE" offset="0x254" width="32" description="">
		<bitfield id="ARAE" width="1" begin="29" end="29" resetval="0x0" description="Accees to Reserve Address Interrupt Enable" range="29" rwaccess="RW"/> 
		<bitfield id="PEDE" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in Data Phase Interrupt Enable" range="28" rwaccess="RW"/> 
		<bitfield id="PEAE" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase Interrupt Enable" range="27" rwaccess="RW"/> 
		<bitfield id="WDIE" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt Enable" range="26" rwaccess="RW"/> 
		<bitfield id="BOE" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status Interrupt Enable" range="25" rwaccess="RW"/> 
		<bitfield id="EWE" width="1" begin="24" end="24" resetval="0x0" description="Warning Status Interrupt Enable" range="24" rwaccess="RW"/> 
		<bitfield id="EPE" width="1" begin="23" end="23" resetval="0x0" description="Error Passive Interrupt Enable" range="23" rwaccess="RW"/> 
		<bitfield id="ELOE" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow Interrupt Enable" range="22" rwaccess="RW"/> 
		<bitfield id="BEUE" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected Interrupt Enable" range="21" rwaccess="RW"/> 
		<bitfield id="BECE" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected Interrupt Enable" range="20" rwaccess="RW"/> 
		<bitfield id="DRX" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer Interrupt Enable" range="19" rwaccess="RW"/> 
		<bitfield id="TOOE" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred Interrupt Enable" range="18" rwaccess="RW"/> 
		<bitfield id="MRAFE" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure Interrupt Enable" range="17" rwaccess="RW"/> 
		<bitfield id="TSWE" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound Interrupt Enable" range="16" rwaccess="RW"/> 
		<bitfield id="TEFLE" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Event Lost Interrupt Enable" range="15" rwaccess="RW"/> 
		<bitfield id="TEFFE" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full Interrupt Enable" range="14" rwaccess="RW"/> 
		<bitfield id="TEFWE" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached Interrupt enable" range="13" rwaccess="RW"/> 
		<bitfield id="TEFNE" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry Interrupt Enable" range="12" rwaccess="RW"/> 
		<bitfield id="TFEE" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty Interrupt Enable" range="11" rwaccess="RW"/> 
		<bitfield id="TCFE" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finishied Interrupt Enable" range="10" rwaccess="RW"/> 
		<bitfield id="TCE" width="1" begin="9" end="9" resetval="0x0" description="Transmission Completed Interrupt Enable" range="9" rwaccess="RW"/> 
		<bitfield id="HPME" width="1" begin="8" end="8" resetval="0x0" description="High Priority message Interrupt Enable" range="8" rwaccess="RW"/> 
		<bitfield id="RF1LE" width="1" begin="7" end="7" resetval="0x0" description="rx FIFO 1 Message Lost Interrupt Enable" range="7" rwaccess="RW"/> 
		<bitfield id="RF1FE" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full Interrupt Enable" range="6" rwaccess="RW"/> 
		<bitfield id="RF1WE" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached Interrupt Enable" range="5" rwaccess="RW"/> 
		<bitfield id="RF1NE" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message Interrupt Enable" range="4" rwaccess="RW"/> 
		<bitfield id="RF0LE" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost Interrupt Enable" range="3" rwaccess="RW"/> 
		<bitfield id="RF0FE" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full Interrupt Enable" range="2" rwaccess="RW"/> 
		<bitfield id="RF0WE" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached Interrupt Enable" range="1" rwaccess="RW"/> 
		<bitfield id="RF0NE" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message Interrupt Enable" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_ILS" acronym="MCAN3_CFG_ILS" offset="0x258" width="32" description="">
		<bitfield id="ARAL" width="1" begin="29" end="29" resetval="0x0" description="Accees to Reserve Address Interrupt Line" range="29" rwaccess="RW"/> 
		<bitfield id="PEDL" width="1" begin="28" end="28" resetval="0x0" description="Protocol Error in Data Phase Interrupt Line" range="28" rwaccess="RW"/> 
		<bitfield id="PEAL" width="1" begin="27" end="27" resetval="0x0" description="Protocol Error in Arbitration Phase Interrupt Line" range="27" rwaccess="RW"/> 
		<bitfield id="WDIL" width="1" begin="26" end="26" resetval="0x0" description="Watchdog Interrupt Line" range="26" rwaccess="RW"/> 
		<bitfield id="BOL" width="1" begin="25" end="25" resetval="0x0" description="Bus_Off Status Interrupt Line" range="25" rwaccess="RW"/> 
		<bitfield id="EWL" width="1" begin="24" end="24" resetval="0x0" description="Warning Status Interrupt Line" range="24" rwaccess="RW"/> 
		<bitfield id="EPL" width="1" begin="23" end="23" resetval="0x0" description="Error Passive Interrupt Line" range="23" rwaccess="RW"/> 
		<bitfield id="ELOL" width="1" begin="22" end="22" resetval="0x0" description="Error Logging Overflow Interrupt Line" range="22" rwaccess="RW"/> 
		<bitfield id="BEUL" width="1" begin="21" end="21" resetval="0x0" description="Bit Error Uncorrected Interrupt Line" range="21" rwaccess="RW"/> 
		<bitfield id="BECL" width="1" begin="20" end="20" resetval="0x0" description="Bit Error Corrected Interrupt Line" range="20" rwaccess="RW"/> 
		<bitfield id="DRXL" width="1" begin="19" end="19" resetval="0x0" description="Message stored to Dedicated Rx Buffer Interrupt Line" range="19" rwaccess="RW"/> 
		<bitfield id="TOOL" width="1" begin="18" end="18" resetval="0x0" description="Timeout Occurred Interrupt Line" range="18" rwaccess="RW"/> 
		<bitfield id="MRAFL" width="1" begin="17" end="17" resetval="0x0" description="Message RAM Access Failure Interrupt Line" range="17" rwaccess="RW"/> 
		<bitfield id="TSWL" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Wraparound Interrupt Line" range="16" rwaccess="RW"/> 
		<bitfield id="TEFLL" width="1" begin="15" end="15" resetval="0x0" description="Tx Event FIFO Event Lost Interrupt Line" range="15" rwaccess="RW"/> 
		<bitfield id="TEFFL" width="1" begin="14" end="14" resetval="0x0" description="Tx Event FIFO Full Interrupt Line" range="14" rwaccess="RW"/> 
		<bitfield id="TEFWL" width="1" begin="13" end="13" resetval="0x0" description="Tx Event FIFO Watermark Reached Interrupt Line" range="13" rwaccess="RW"/> 
		<bitfield id="TEFNL" width="1" begin="12" end="12" resetval="0x0" description="Tx Event FIFO New Entry Interrupt Line" range="12" rwaccess="RW"/> 
		<bitfield id="TFEL" width="1" begin="11" end="11" resetval="0x0" description="Tx FIFO Empty Interrupt Line" range="11" rwaccess="RW"/> 
		<bitfield id="TCFL" width="1" begin="10" end="10" resetval="0x0" description="Transmission Cancellation Finishied Interrupt Line" range="10" rwaccess="RW"/> 
		<bitfield id="TCL" width="1" begin="9" end="9" resetval="0x0" description="Transmission Completed Interrupt Line" range="9" rwaccess="RW"/> 
		<bitfield id="HPML" width="1" begin="8" end="8" resetval="0x0" description="High Priority message Interrupt Line" range="8" rwaccess="RW"/> 
		<bitfield id="RF1LL" width="1" begin="7" end="7" resetval="0x0" description="rx FIFO 1 Message Lost Interrupt Line" range="7" rwaccess="RW"/> 
		<bitfield id="RF1FL" width="1" begin="6" end="6" resetval="0x0" description="Rx FIFO 1 Full Interrupt Line" range="6" rwaccess="RW"/> 
		<bitfield id="RF1WL" width="1" begin="5" end="5" resetval="0x0" description="Rx FIFO 1 Watermark Reached Interrupt Line" range="5" rwaccess="RW"/> 
		<bitfield id="RF1NL" width="1" begin="4" end="4" resetval="0x0" description="Rx FIFO 1 New Message Interrupt Line" range="4" rwaccess="RW"/> 
		<bitfield id="RF0LL" width="1" begin="3" end="3" resetval="0x0" description="Rx FIFO 0 Message Lost Interrupt Line" range="3" rwaccess="RW"/> 
		<bitfield id="RF0FL" width="1" begin="2" end="2" resetval="0x0" description="Rx FIFO 0 Full Interrupt Line" range="2" rwaccess="RW"/> 
		<bitfield id="RF0WL" width="1" begin="1" end="1" resetval="0x0" description="Rx FIFO 0 Watermark Reached Interrupt Line" range="1" rwaccess="RW"/> 
		<bitfield id="RF0NL" width="1" begin="0" end="0" resetval="0x0" description="Rx FIFO 0 New Message Interrupt Line" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN3_CFG_ILE" acronym="MCAN3_CFG_ILE" offset="0x25C" width="32" description="">
		<bitfield id="EINT1" width="1" begin="1" end="1" resetval="0x0" description="Enable Interrupt Line 1" range="1" rwaccess="RW"/> 
		<bitfield id="EINT0" width="1" begin="0" end="0" resetval="0x0" description="Enable Interrupt Line 0" range="0" rwaccess="RW"/>
	</register>
